Revit 2027 API
FabricationPartSizeMap.ProfileType Property
 The shape of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorProfileType ProfileType { get; set; }
Public Property ProfileType As ConnectorProfileType
	Get
	Set
public:
property ConnectorProfileType ProfileType {
	ConnectorProfileType get ();
	void set (ConnectorProfileType value);
}
member ProfileType : ConnectorProfileType with get, set
Property Value
ConnectorProfileType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace